In [1]:
import pandas as pd 
import pandasql

In [3]:
data = [['John', 50, 'Austin', 70],
        ['Cataline', 45 , 'San Francisco', 80],
        ['Matt', 30, 'Boston' , 95]]

columns = ['Name', 'Age', 'City', 'Marks']

#row indexes
idx = ['x', 'y', 'z']

df = pd.DataFrame(data, columns=columns, index=idx)

print(df)

       Name  Age           City  Marks
x      John   50         Austin     70
y  Cataline   45  San Francisco     80
z      Matt   30         Boston     95

In [4]:
df

       Name  Age           City  Marks
x      John   50         Austin     70
y  Cataline   45  San Francisco     80
z      Matt   30         Boston     95

In [5]:
# select all using sql 
pandasql.sqldf("SELECT * FROM df LIMIT 10;", globals())

       Name  Age           City  Marks
0      John   50         Austin     70
1  Cataline   45  San Francisco     80
2      Matt   30         Boston     95

In [6]:
pandasql.sqldf("SELECT Name FROM df")

       Name
0      John
1  Cataline
2      Matt

In [24]:
pandasql.sqldf("\
               SELECT * FROM df \
               WHERE Name = 'John';")

   Name  Age    City  Marks
0  John   50  Austin     70

In [26]:
pandasql.sqldf("\
               SELECT NULL FROM df \
                ;")

   NULL
0  None
1  None
2  None

In [29]:
import numpy as np
timestamps = pd.date_range(start='2018-01-01', end='2023-12-31', freq='M')

# Create a sample dataframe
data = {
    'timestamp': timestamps,
    'value': np.random.randint(1, 100, size=len(timestamps))
}

df = pd.DataFrame(data)

print(df.head())

   timestamp  value
0 2018-01-31      8
1 2018-02-28     10
2 2018-03-31     96
3 2018-04-30     59
4 2018-05-31     82

C:\Users\Hansen Pen\AppData\Local\Temp\ipykernel_32280\2252491948.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  timestamps = pd.date_range(start='2018-01-01', end='2023-12-31', freq='M')

In [30]:
pandasql.sqldf("\
               SELECT * FROM df \
                ;")

                     timestamp  value
0   2018-01-31 00:00:00.000000      8
1   2018-02-28 00:00:00.000000     10
2   2018-03-31 00:00:00.000000     96
3   2018-04-30 00:00:00.000000     59
4   2018-05-31 00:00:00.000000     82
..                         ...    ...
67  2023-08-31 00:00:00.000000     49
68  2023-09-30 00:00:00.000000     50
69  2023-10-31 00:00:00.000000     63
70  2023-11-30 00:00:00.000000     48
71  2023-12-31 00:00:00.000000     36

[72 rows x 2 columns]

In [32]:
pandasql.sqldf("\
               SELECT * FROM df \
               WHERE timestamp BETWEEN '2018-01-01' AND '2020-01-01' \
               LIMIT 10 ;")

                    timestamp  value
0  2018-01-31 00:00:00.000000      8
1  2018-02-28 00:00:00.000000     10
2  2018-03-31 00:00:00.000000     96
3  2018-04-30 00:00:00.000000     59
4  2018-05-31 00:00:00.000000     82
5  2018-06-30 00:00:00.000000      6
6  2018-07-31 00:00:00.000000     60
7  2018-08-31 00:00:00.000000     84
8  2018-09-30 00:00:00.000000     77
9  2018-10-31 00:00:00.000000     74